In [2]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd

data = [4,5,15,16,23,42]
series = pd.Series(data)

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
series

0     4
1     5
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

data2 = [1,2,3,4,5,6,7,8,9,10]

series2 = pd.Series(data2)
series2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [5]:
# Q3. Create a Pandas DataFrame that contains the following data:

# Then, print the DataFrame.

my_data = {"Name": ["Alice", "Bob", "Claire"], "Age":[25,30,27], "Gender":["Female", "Male", "Female"]}

df = pd.DataFrame(my_data)

In [6]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
"""In Pandas, a DataFrame is a 2-dimensional labeled data structure that is commonly used for data manipulation and analysis. It is similar to a spreadsheet or SQL table, where data is organized into rows and columns. A DataFrame can be thought of as a collection of Pandas Series objects, where each column represents a Series.

A Pandas Series, on the other hand, is a one-dimensional labeled array that can hold any data type (e.g. integers, floats, strings, etc.). A Series is similar to a Python list or NumPy array, but with additional indexing capabilities."""

data2 = [1,2,3,4,5,6,7,8,9,10]

series2 = pd.Series(data2)

my_data = {"Name": ["Alice", "Bob", "Claire"], "Age":[25,30,27], "Gender":["Female", "Male", "Female"]}

df = pd.DataFrame(my_data)

series2, df

(0     1
 1     2
 2     3
 3     4
 4     5
 5     6
 6     7
 7     8
 8     9
 9    10
 dtype: int64,
      Name  Age  Gender
 0   Alice   25  Female
 1     Bob   30    Male
 2  Claire   27  Female)

In [17]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

# There are some common function like Header, to print first five data, or to print last five data these are some common functions

df
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [18]:
df.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

"""In Pandas, both Series and DataFrame are mutable in nature, while Panel is not mutable.

A mutable object is one that can be modified after it is created, while an immutable object cannot be modified after it is created.

For example, you can add, remove, or modify elements in a Pandas Series or DataFrame after they are created. However,
a Panel object, which is a 3-dimensional data structure in Pandas, is not mutable. Once a Panel is created, you cannot modify its data directly. 
Instead, you must create a new Panel object with the modified data."""

In [25]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

name =  pd.Series(["Alice", "BOb", "Charlie"])
age = pd.Series([25,30,27])
gender = pd.Series(["Female", "Male", "Female"])

data3 = {"Name": name, "Age": age, "Gender": gender}
my_df = pd.DataFrame(data3)
my_df

      Name  Age  Gender
0    Alice   25  Female
1      BOb   30    Male
2  Charlie   27  Female